Revit 2016 API
ExportLinetypeTable.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo))
Visual C++
public:
virtual IEnumerator<KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^>>^ GetEnumerator()
Return Value
An IEnumerator( KeyValuePair(ExportLinetypeKey^,ExportLinetypeInfo^) ) object that can be used to iterate through key-value pairs in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace